app/views/recipes/_ingredients.html.erb

<% recipe.ingredients.each do |i| %>
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "measurements" ON "ingredients"."id" = "measurements"."ingredient_id" WHERE "measurements"."recipe_id" = $1  ORDER BY name ASC  [["recipe_id", 340936797]]