app/views/recipes/show.html.erb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "measurements" ON "ingredients"."id" = "measurements"."ingredient_id" WHERE "measurements"."recipe_id" = $1  [["recipe_id", 1]]
---

<% @recipe.ingredients.each do |i| %>