app/views/ingredients/_ingredient.html.erb

SELECT  "measurements".* FROM "measurements"  WHERE "measurements"."recipe_id" = $1 AND "measurements"."ingredient_id" = 820428662  ORDER BY "measurements"."id" ASC LIMIT 1  [["recipe_id", 340936797]]
---
  		<% if @recipe %>
			  <% measurement = @recipe.measurements.where(ingredient_id: ingredient.id).first %>