app/views/ratings/_rating.html.erb

SELECT SUM("ratings"."rating") AS sum_id FROM "ratings"  WHERE "ratings"."recipe_id" = $1  [["recipe_id", 340936797]]
---
<div class="leaves">
	<% unless recipe.rating.blank?%>