app/controllers/images_controller.rb

INSERT INTO "images" ("created_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @image = Image.new(image_params)
    if @image.save

SELECT  "images".* FROM "images"  WHERE "images"."id" = $1 LIMIT 1  [["id", 233574227]]
UPDATE "images" SET "image_file_name" = $1, "image_content_type" = $2, "image_file_size" = $3, "image_updated_at" = $4 WHERE "images"."id" = 62  [["image_file_name", "green-smoothie-points.jpg"], ["image_content_type", "image/jpeg"], ["image_file_size", 60755], ["image_updated_at", Sun, 01 Dec 2013 04:19:10 UTC +00:00]]
---
  def update
    @image = Image.find(params[:id])
    @image.update_attributes(image_params)

SELECT  "images".* FROM "images"  WHERE "images"."id" = $1 LIMIT 1  [["id", 233574227]]
---
  def edit
    @image = Image.find(params[:id])