app/controllers/ingredients_controller.rb

  def edit
    @ingredient = Ingredient.find(params[:id])
---
SELECT  "ingredients".* FROM "ingredients"  WHERE "ingredients"."id" = $1  ORDER BY name ASC LIMIT 1  [["id", 820428662]]

  def create
    @ingredient = Ingredient.new(ingredient_params)
    @elem = params[:elem]
    if @ingredient.save
---
INSERT INTO "ingredients" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-12-28 22:05:02.570335"], ["name", "Lettuce"], ["updated_at", "2015-12-28 22:05:02.570335"]]

  def show
    @ingredient = Ingredient.find(params[:id])
---
SELECT  "ingredients".* FROM "ingredients"  WHERE "ingredients"."id" = $1  ORDER BY name ASC LIMIT 1  [["id", 820428662]]

  def update
    @ingredient = Ingredient.find(params[:id])
    if @ingredient.update_attributes(ingredient_params)
---
SELECT  "ingredients".* FROM "ingredients"  WHERE "ingredients"."id" = $1  ORDER BY name ASC LIMIT 1  [["id", 820428662]]
UPDATE "ingredients" SET "name" = $1, "updated_at" = $2 WHERE "ingredients"."id" = 820428662  [["name", "Not kale"], ["updated_at", "2015-12-28 22:10:47.569722"]]