app/controllers/nutrients_controller.rb

  def edit
    @nutrient = Nutrient.find(params[:id])
---
SELECT  "nutrients".* FROM "nutrients"  WHERE "nutrients"."id" = $1  ORDER BY name ASC LIMIT 1  [["id", 312016764]]

  def show
    @nutrient = Nutrient.find(params[:id])
---
SELECT  "nutrients".* FROM "nutrients"  WHERE "nutrients"."id" = $1  ORDER BY name ASC LIMIT 1  [["id", 312016764]]

  def update
    @nutrient = Nutrient.find(params[:id])
    if @nutrient.update_attributes(nutrient_params)
---
SELECT  "nutrients".* FROM "nutrients"  WHERE "nutrients"."id" = $1  ORDER BY name ASC LIMIT 1  [["id", 312016764]]
UPDATE "nutrients" SET "name" = $1, "updated_at" = $2 WHERE "nutrients"."id" = 312016764  [["name", "Carbs"], ["updated_at", "2015-12-29 06:37:04.365715"]]