app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 982773358]]
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO "posts" ("abstract", "body", "created_at", "name", "updated_at", "url_name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 982773358]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 982773358]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 982773358]]
UPDATE "posts" SET "name" = $1, "updated_at" = $2, "url_name" = $3 WHERE "posts"."id" = 982773358  [["name", "New name"], ["updated_at", "2015-12-30 04:45:42.120398"], ["url_name", "new-name"]]
---
  def update
    @post = Post.find(params[:id])
    @post.update_attributes(post_params)