app/controllers/ratings_controller.rb

  def create
    @rating = Rating.new(recipe_id: params[:recipe_id], rating: params[:rating], user_id: current_user.id)
    @recipe = Recipe.find(params[:recipe_id])
    if !current_user.rating?(@recipe) && @rating.save
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 340936797]]
INSERT INTO "ratings" ("created_at", "rating", "recipe_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-12-30 05:14:49.026907"], ["rating", 5], ["recipe_id", 340936797], ["updated_at", "2015-12-30 05:14:49.026907"], ["user_id", 403821611]]
UPDATE "recipes" SET "rating" = 5.0 WHERE "recipes"."id" = 340936797