app/controllers/recipes_controller.rb

  def index
    @search = Recipe.ransack(params[:q])
    @recipes = Kaminari.paginate_array(@search.result(distinct: true)).page(params[:page]).per(8)
---
SELECT COUNT(*) FROM "recipes"
SELECT DISTINCT "recipes".* FROM "recipes"   ORDER BY created_at DESC

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 340936797]]

  def create
    find_or_create_ingredients
    @recipe = Recipe.new(recipe_params)
    if @recipe.save
---
INSERT INTO "recipes" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-12-30 18:07:06.675733"], ["description", "A yummy recipe"], ["name", "Test Recipe"], ["updated_at", "2015-12-30 18:07:06.675733"]]

  def show
    # find_by_id is for legacy urls
    @recipe = Recipe.find_by_url_name(params[:id]) || Recipe.find_by_id(params[:id])
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 340936797]]

  def update
    @recipe = Recipe.find(params[:id])
    find_or_create_ingredients
    if @recipe.update_attributes(recipe_params)
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 340936797]]
UPDATE "recipes" SET "image_updated_at" = $1, "updated_at" = $2, "image_file_name" = $3 WHERE "recipes"."id" = 2  [["image_updated_at", Fri, 29 Nov 2013 07:25:33 UTC +00:00], ["updated_at", Fri, 29 Nov 2013 07:25:33 UTC +00:00], ["image_file_name", "green-smoothie-points.jpg"]]

  def destroy
    @recipe = Recipe.find(params[:id])
    authorize! :manage, @recipe
    @recipe.destroy
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 340936797]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 340936797]]

  def find_or_create_ingredients
    params[:recipe][:measurements_attributes].each do |k,v|
      ingredient = Ingredient.find_or_create(v['ingredient']['name'].downcase)
---
SELECT  "ingredients".* FROM "ingredients"  WHERE (lower(name) = 'beets')  ORDER BY name ASC LIMIT 1