app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 403821611  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."user_id" = $1  ORDER BY created_at DESC LIMIT 10 OFFSET 0  [["user_id", 403821611]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "recipes"  WHERE "recipes"."user_id" = $1 LIMIT 10 OFFSET 0) subquery_for_count  [["user_id", 403821611]]
---
  def show
    @user = User.find(params[:id])
    @recipes = @user.recipes.page(params[:page]).per(10)

UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = 403821611  [["encrypted_password", "$2a$04$0juloLzMcKLFQb0C9DVxkuE.zwv2tMGZXkdvwsKOsi0f8VzdNiMbC"], ["updated_at", "2015-12-30 18:49:23.913795"]]
---
  def update
    if !user_params[:password].blank? && @user.update_attributes(user_params)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 403821611  ORDER BY "users"."id" ASC LIMIT 1
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 403821611]]
---
  def destroy
    @user = User.find(params[:id])
    sign_out(@user)
    @user.destroy