app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 403821611  ORDER BY "users"."id" ASC LIMIT 1